# CustomFieldData Properties

---
The CustomFieldData type exposes the following members.
| Name| Description
---|---|---
| DefaultRowHeightOnSheet|  Identifies the default row height for this field.
| FieldName|  The name of this custom field.
| FieldTooltip|  The tooltip that will be shown in the schedule properties dialog for this custom field.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CustomFieldData Class
Autodesk.Revit.DB Namespace